# def test_greeting():
#     name = "Анна"
#     age = 25
#     output = f"Привет, {name}! Тебе {age} лет."
#     print(output)
#     assert output == "Привет, Анна! Тебе 25 лет."

# def test_rectangle():
#     """
#     Напишите программу, которая берет длину и ширину прямоугольника
#     и считает его периметр и площадь.
#     """
#     a = 10
#     b = 20
#     # TODO сосчитайте периметр
#     perimeter = 2 * (a + b)
#     print(perimeter)
#     assert perimeter == 60
#     area = a * b
#     assert area == 200

